Revit 2027 API
RouteAnalysisSettings.SetIgnoredCategoryIds Method
 Sets the ElementIds for Category elements which are ignored by route calculation.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetIgnoredCategoryIds(
	ICollection<ElementId> categoryIds
)
Public Sub SetIgnoredCategoryIds (
	categoryIds As ICollection(Of ElementId)
)
public:
void SetIgnoredCategoryIds(
	ICollection<ElementId^>^ categoryIds
)
member SetIgnoredCategoryIds :
        categoryIds : ICollection<ElementId> -> unit
Parameters
categoryIds ICollection<ElementId>
 The ids of Categories to be ignored by route calculation.
Exceptions
Exception | Condition
ArgumentException |  One or more ElementIds in categoryIds are not valid Category element ids.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RouteAnalysisSettings Class
Autodesk.Revit.DB.Analysis Namespace